11/data/attachments/a7b879c4d2e317d9.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_5e988d66-c39f-4d93-a2ee-289563e171dc</nif:username>
            <nif:friendToBeAdded>Shawn_physical_Friend_67431_7</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>